Public Member Functions | List of all members
ACAPI::MEP::Equipment::Modifier Class Reference
MEP Element Manager
Modifier of the Equipment. More...
#include <MEPEquipment.hpp>
 Inheritance diagram for ACAPI::MEP::Equipment::Modifier:
 Public Member Functions
Result< void >  | Inject (const EquipmentDefault &equipmentDefault)
Injects the Default settings into the Equipment.
 Public Member Functions inherited from ACAPI::MEP::ModifiableElementBase::Modifier
void  | SetAnchorPoint (const API_Coord3D &anchorPoint)
Sets the anchor point of the ModifiableElement.
void  | SetOrientation (const MEP::Orientation &orientation)
Sets the orientation of the ModifiableElement.
void  | SetObjectId (const API_Guid &libraryPartId)
Sets the referenced library part of the ModifiableElement.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::MEP::ModifiableElementBase::Modifier
Modifier (ModifiableElementBase &parent)
Constructs a Modifier with the parent ModifiableElementBase.
 void  | FinalizeModification () override
Finalizes the modifications.
Detailed Description
Modifier of the Equipment.
Member Function Documentation
◆ Inject()
 Result< void > ACAPI::MEP::Equipment::Modifier::Inject  |  ( |  const EquipmentDefault & |  equipmentDefault | )
Injects the Default settings into the Equipment.
Parameters
equipmentDefault | The Default what will be injected.
Returns
Returns an error if the injection fails for some reason, otherwise nothing.